# Pandas Vignette

March 30, 2022

Vignette: Pandas, reading csv, DataFrames, filtering, and wrangling data

@author: Oscar A. Trevizo

### References
1. "Pandas General Functions" (accessed Feb. 20, 2022) 
    https://pandas.pydata.org/pandas-docs/stable/reference/general_functions.html
    https://pandas.pydata.org/docs/reference/io.html
    https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html
1. "Kaggle" (accessed Mar. 20, 2022)
    https://www.kaggle.com/
    https://www.kaggle.com/datasets/rishidamarla/fifa-players-ratings
1. UCI Machine Learning Repository 
    https://archive.ics.uci.edu/ml/datasets.php
1. Additional references:
    https://stackoverflow.com/tags/pandas/
    https://www.w3schools.com/python/pandas/default.asp
    https://www.geeksforgeeks.org/pandas-tutorial/

# Pandas

## Import libraries

In [1]:
import pandas as pd
import numpy as np

## Load data from a csv

In [2]:
# https://www.kaggle.com/datasets/rishidamarla/fifa-players-ratings
# And specify which columns to load
df = pd.read_csv('fifa_cleaned.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17954 entries, 0 to 17953
Data columns (total 92 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   id                             17954 non-null  int64
 1   name                           17954 non-null  object
 2   full_name                      17954 non-null  object
 3   birth_date                     17954 non-null  object
 4   age                            17954 non-null  int64
 5   height_cm                      17954 non-null  float64
 6   weight_kgs                     17954 non-null  float64
 7   positions                      17954 non-null  object
 8   nationality                    17954 non-null  object
 9   overall_rating                 17954 non-null  int64
 10  potential                      17954 non-null  int64
 11  value_euro                     17699 non-null  float64
 12  wage_euro                      17708 non-null  float64
 13  preferred_foot                 17954 non-null  object
 14  international_reputation(1-5)  17954 non-null  int64
 15  weak_foot(1-5)                 17954 non-null  int64
 16  skill_moves(1-5)               17954 non-null  int64
 17  work_rate                      17954 non-null  object
 18  body_type                      17954 non-null  object
 19  release_clause_euro            16117 non-null  float64
 20  club_team                      17940 non-null  object
 21  club_rating                    17940 non-null  float64
 22  club_position                  17940 non-null  object
 23  club_jersey_number             17940 non-null  float64
 24  club_join_date                 16018 non-null  object
 25  contract_end_year              17593 non-null  object
 26  national_team                  857 non-null    object
 27  national_rating                857 non-null    float64
 28  national_team_position         857 non-null    object
 29  national_jersey_number         857 non-null    float64
 30  crossing                       17954 non-null  int64
 31  finishing                      17954 non-null  int64
 32  heading_accuracy               17954 non-null  int64
 33  short_passing                  17954 non-null  int64
 34  volleys                        17954 non-null  int64
 35  dribbling                      17954 non-null  int64
 36  curve                          17954 non-null  int64
 37  freekick_accuracy              17954 non-null  int64
 38  long_passing                   17954 non-null  int64
 39  ball_control                   17954 non-null  int64
 40  acceleration                   17954 non-null  int64
 41  sprint_speed                   17954 non-null  int64
 42  agility                        17954 non-null  int64
 43  reactions                      17954 non-null  int64
 44  balance                        17954 non-null  int64
 45  shot_power                     17954 non-null  int64
 46  jumping                        17954 non-null  int64
 47  stamina                        17954 non-null  int64
 48  strength                       17954 non-null  int64
 49  long_shots                     17954 non-null  int64
 50  aggression                     17954 non-null  int64
 51  interceptions                  17954 non-null  int64
 52  positioning                    17954 non-null  int64
 53  vision                         17954 non-null  int64
 54  penalties                      17954 non-null  int64
 55  composure                      17954 non-null  int64
 56  marking                        17954 non-null  int64
 57  standing_tackle                17954 non-null  int64
 58  sliding_tackle                 17954 non-null  int64
 59  GK_diving                      17954 non-null  int64
 60  GK_handling                    17954 non-null  int64
 61  GK_kicking                     17954 non-null  int64
 62  GK_positioning                 17954 non-null  int64
 63  GK_reflexes                    17954 non-null  int64
 64  tags                           1417 non-null   object
 65  traits                         8137 non-null   object
 66  LS                             15889 non-null  object
 67  ST                             15889 non-null  object
 68  RS                             15889 non-null  object
 69  LW                             15889 non-null  object
 70  LF                             15889 non-null  object
 71  CF                             15889 non-null  object
 72  RF                             15889 non-null  object
 73  RW                             15889 non-null  object
 74  LAM                            15889 non-null  object
 75  CAM                            15889 non-null  object
 76  RAM                            15889 non-null  object
 77  LM                             15889 non-null  object
 78  LCM                            15889 non-null  object
 79  CM                             15889 non-null  object
 80  RCM                            15889 non-null  object
 81  RM                             15889 non-null  object
 82  LWB                            15889 non-null  object
 83  LDM                            15889 non-null  object
 84  CDM                            15889 non-null  object
 85  RDM                            15889 non-null  object
 86  RWB                            15889 non-null  object
 87  LB                             15889 non-null  object
 88  LCB                            15889 non-null  object
 89  CB                             15889 non-null  object
 90  RCB                            15889 non-null  object
 91  RB                             15889 non-null  object
dtypes: float64(9), int64(41), object(42)
memory usage: 12.6+ MB

In [4]:
# https://www.kaggle.com/datasets/rishidamarla/fifa-players-ratings
# And specify which columns to load
df = pd.read_csv('fifa_cleaned.csv', usecols = ['id', 'name', 'birth_date', 'age',
                                                'height_cm', 'weight_kgs', 'positions',
                                                'club_team', 'national_team', 'overall_rating',
                                                'wage_euro'])

In [5]:
df.head()

,id,name,birth_date,age,height_cm,weight_kgs,positions,overall_rating,wage_euro,club_team,national_team
0,158023,L. Messi,1987-06-24,31,170.18,72.1,"CF,RW,ST",94,565000.0,FC Barcelona,Argentina
1,190460,C. Eriksen,1992-02-14,27,154.94,76.2,"CAM,RM,CM",88,205000.0,Tottenham Hotspur,Denmark
2,195864,P. Pogba,1993-03-15,25,190.50,83.9,"CM,CAM",88,255000.0,Manchester United,France
3,198219,L. Insigne,1991-06-04,27,162.56,59.0,"LW,ST",88,165000.0,Napoli,Italy
4,201024,K. Koulibaly,1991-06-20,27,187.96,88.9,CB,88,135000.0,Napoli,NaN

In [6]:
df.shape

(17954, 11)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17954 entries, 0 to 17953
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              17954 non-null  int64
 1   name            17954 non-null  object
 2   birth_date      17954 non-null  object
 3   age             17954 non-null  int64
 4   height_cm       17954 non-null  float64
 5   weight_kgs      17954 non-null  float64
 6   positions       17954 non-null  object
 7   overall_rating  17954 non-null  int64
 8   wage_euro       17708 non-null  float64
 9   club_team       17940 non-null  object
 10  national_team   857 non-null    object
dtypes: float64(3), int64(3), object(5)
memory usage: 1.5+ MB

In [8]:
# describe statistics
df.describe()

,id,age,height_cm,weight_kgs,overall_rating,wage_euro
count,17954.000000,17954.000000,17954.000000,17954.000000,17954.000000,17708.000000
mean,215411.087780,25.565445,174.946921,75.301047,66.240169,9902.134628
std,29758.387106,4.705708,14.029449,7.083684,6.963730,21995.593750
min,16.000000,17.000000,152.400000,49.900000,47.000000,1000.000000
25%,201117.250000,22.000000,154.940000,69.900000,62.000000,1000.000000
50%,222919.000000,25.000000,175.260000,74.800000,66.000000,3000.000000
75%,237613.500000,29.000000,185.420000,79.800000,71.000000,9000.000000
max,247607.000000,46.000000,205.740000,110.200000,94.000000,565000.000000

## Filters

In [9]:
# %% Filter basics
#
# A filter is based on a boolean test that returns True or False
#
df['wage_euro'] >= 3000

0         True
1         True
2         True
3         True
4         True
         ...
17949     True
17950    False
17951    False
17952     True
17953    False
Name: wage_euro, Length: 17954, dtype: bool

In [10]:
# %% 1st Approach - Filter simple approach
# The boolean test, True or False can be applied to each row
# Get players with wages above the 50 percentile
df_wage_gt_3K = df[df['wage_euro'] >= 3000]
df_wage_gt_3K.shape

(10216, 11)

In [11]:
# Show top 5 using sort_values by wage and head
df_wage_gt_3K.sort_values(by=['wage_euro'], ascending=False).head()

,id,name,birth_date,age,height_cm,weight_kgs,positions,overall_rating,wage_euro,club_team,national_team
0,158023,L. Messi,1987-06-24,31,170.18,72.1,"CF,RW,ST",94,565000.0,FC Barcelona,Argentina
17938,176580,L. Suárez,1987-01-24,32,182.88,86.2,ST,91,455000.0,FC Barcelona,Uruguay
17939,177003,L. Modrić,1985-09-09,33,172.72,66.2,CM,91,420000.0,Real Madrid,NaN
17944,20801,Cristiano Ronaldo,1985-02-05,34,187.96,83.0,"ST,LW",94,405000.0,Juventus,Portugal
17924,173731,G. Bale,1989-07-16,29,185.42,82.1,"RW,LW,ST",88,355000.0,Real Madrid,Wales

In [12]:
# %% Filter select columns and sort one step
#
filter_boolean = df['wage_euro'] >= 3000
# Make a list of column headers
specific_columns = ['name', 'wage_euro', 'club_team', 'national_team']
# Then assign that list to the dataframe and use the boolean to select only true
df_wage_50_less_columns = df[specific_columns][filter_boolean].sort_values(by=['wage_euro'], ascending=False)
df_wage_50_less_columns.head()

                    name  wage_euro     club_team national_team
0               L. Messi   565000.0  FC Barcelona     Argentina
17938          L. Suárez   455000.0  FC Barcelona       Uruguay
17939          L. Modrić   420000.0   Real Madrid           NaN
17944  Cristiano Ronaldo   405000.0      Juventus      Portugal
17924            G. Bale   355000.0   Real Madrid         Wales

In [13]:
# %% Filter multiple conditions
#
# Apply two conditions. Get players with wages above the 50 percentile, and national team is Brazil
#
df_wage_50_brazil = df[(df['wage_euro'] >= 3000) & (df['national_team'] == 'Brazil')]
df_wage_50_brazil.shape

(23, 11)

In [14]:
# Show top 5 using sort_values by wage and head
df_wage_50_brazil.sort_values(by=['wage_euro'], ascending=False).head()

,id,name,birth_date,age,height_cm,weight_kgs,positions,overall_rating,wage_euro,club_team,national_team
17943,190871,Neymar Jr,1992-02-05,27,175.26,68.0,"LW,CAM",92,290000.0,Paris Saint-Germain,Brazil
17833,230294,Louri Beretta,1992-02-29,27,187.96,83.0,"ST,CF",83,60000.0,Atlético Mineiro,Brazil
17835,230481,Ronaldo Cabrais,1992-02-29,27,152.40,74.8,"RW,CAM",83,51000.0,Grêmio,Brazil
76,230258,Rosberto Dourado,1988-02-29,31,175.26,69.9,"CDM,CM",82,46000.0,Atlético Mineiro,Brazil
17834,230375,Josué Chiamulera,1992-02-29,27,185.42,79.8,CB,83,43000.0,Grêmio,Brazil

In [15]:
# %% Filter unique select one columns (a list)
#
# Need 
filter_boolean = df['wage_euro'] >= 3000
# Then assign that list to the dataframe and use the boolean to select only true
# And dropna()
df_top_natl_tm = df['national_team'][filter_boolean].dropna()

df_top_natl_tm = df_top_natl_tm.unique()    # returns a numpy array series
type(df_top_natl_tm)

numpy.ndarray

In [16]:
# Displaying the numpy array series
df_top_natl_tm

array(['Argentina', 'Denmark', 'France', 'Italy', 'Netherlands',
       'Germany', 'Uruguay', 'Spain', 'Belgium', 'Egypt', 'Colombia',
       'Sporting CP', 'Portugal', 'Dalian YiFang FC', 'Mexico', 'Brazil',
       'England', 'Austria', 'Al Hilal', 'Iceland', 'Hungary', 'Wales',
       'Cameroon', "Côte d'Ivoire", 'Australia', 'FC Porto', 'Romania',
       'Chile', 'Norway', 'Venezuela', 'Sweden', 'Scotland', 'Canada',
       'SL Benfica', 'Poland', 'Turkey', 'Northern Ireland',
       'Santos Laguna', 'New Zealand', 'United States',
       'Republic of Ireland', 'Ecuador', 'Pachuca', 'Peru', 'Slovenia',
       'Racing Club', 'FC Red Bull Salzburg', 'Puebla FC',
       'Universidad de Chile', 'Club Tijuana', 'Paraguay', 'Querétaro',
       'South Africa', 'Cruz Azul', 'Switzerland', 'BSC Young Boys',
       'Atlético Nacional', 'Finland', 'Melbourne Victory',
       'Independiente Santa Fe', 'Melbourne City FC',
       'Club Atlético Talleres', 'Urawa Red Diamonds', 'Al Ahli',
       'FK Austria Wien', 'Al Wehda', 'Bulgaria', 'Monarcas Morelia',
       'Sydney FC', 'Club Atlas', 'Al Ittihad', 'Boca Juniors',
       'Vélez Sarsfield', 'CD Tondela', 'Colo-Colo', 'Czech Republic',
       'Club Necaxa', 'Perth Glory', 'Western Sydney Wanderers',
       'Nagoya Grampus', 'FC Basel 1893', 'Greece', 'Club León',
       'Club Atlético Banfield', 'Russia', 'Club América',
       'Tigres U.A.N.L.', 'Independiente', 'Monterrey', 'Henan Jianye FC',
       'Grasshopper Club Zürich', 'Neuchâtel Xamax', 'SK Rapid Wien',
       'Vitória Guimarães', 'Junior FC', 'River Plate'], dtype=object)

In [17]:
# Convert numpy array to Pandas series
df_top_natl_tm = pd.Series(df_top_natl_tm)
type(df_top_natl_tm)

pandas.core.series.Series

In [18]:
df_top_natl_tm.head()

0      Argentina
1        Denmark
2         France
3          Italy
4    Netherlands
dtype: object

## Create a DataFrame

In [19]:
# Get the data
first_name = [" Joan", "Mary ", " Vijay ", "Rob ", "Martha", "Josh", " Vicky", " Mario", "Jenny", "Joe"]
last_name = [" T"," K ", " N ", "R ", "L", "F ", " R", " L", "%^", "P"]
score_1 = [91, 83, 95, 72, 91, 85, 89, 82, 'abc', 79]
score_2 = [91, 85, 90, 81, 95, 92, 88, 94, 'xyz', 75]

# Build the dataframe
df = pd.DataFrame({'first_name':first_name, 'last_name':last_name,'score_1':score_1,'score_2':score_2}  )
df.head(10)

  first_name last_name score_1 score_2
0       Joan         T      91      91
1      Mary         K       83      85
2     Vijay         N       95      90
3       Rob         R       72      81
4     Martha         L      91      95
5       Josh        F       85      92
6      Vicky         R      89      88
7      Mario         L      82      94
8      Jenny        %^     abc     xyz
9        Joe         P      79      75

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  10 non-null     object
 1   last_name   10 non-null     object
 2   score_1     10 non-null     object
 3   score_2     10 non-null     object
dtypes: object(4)
memory usage: 448.0+ bytes

## To numeric

In [21]:
df['score_1'] = pd.to_numeric(df['score_1'], errors='coerce')

In [22]:
df['score_2'] = pd.to_numeric(df['score_2'], errors='coerce')

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  10 non-null     object
 1   last_name   10 non-null     object
 2   score_1     9 non-null      float64
 3   score_2     9 non-null      float64
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

In [24]:
df.describe()

         score_1    score_2
count   9.000000   9.000000
mean   85.222222  87.888889
std     7.120003   6.527719
min    72.000000  75.000000
25%    82.000000  85.000000
50%    85.000000  90.000000
75%    91.000000  92.000000
max    95.000000  95.000000

## Clean up blank spaces

In [25]:
# Strip right and left spaces
df["first_name"] = df["first_name"].str.strip()
df["last_name"] = df["last_name"].str.strip()
df.head(10)

  first_name last_name  score_1  score_2
0       Joan         T     91.0     91.0
1       Mary         K     83.0     85.0
2      Vijay         N     95.0     90.0
3        Rob         R     72.0     81.0
4     Martha         L     91.0     95.0
5       Josh         F     85.0     92.0
6      Vicky         R     89.0     88.0
7      Mario         L     82.0     94.0
8      Jenny        %^      NaN      NaN
9        Joe         P     79.0     75.0

## Regex clean up characters
http://localhost:8888/notebooks/Python/Jupyter_Vignettes/regex_vignette.ipynb

In [26]:
df["last_name"] = df["last_name"].replace('[^A-Za-z]', np.NaN, regex=True)
df["score_1"] = df["score_1"].replace('[^0-9]', np.NaN, regex=True)
df["score_2"] = df["score_2"].replace('[^0-9]', np.NaN, regex=True)

df.head(10)

  first_name last_name  score_1  score_2
0       Joan         T     91.0     91.0
1       Mary         K     83.0     85.0
2      Vijay         N     95.0     90.0
3        Rob         R     72.0     81.0
4     Martha         L     91.0     95.0
5       Josh         F     85.0     92.0
6      Vicky         R     89.0     88.0
7      Mario         L     82.0     94.0
8      Jenny       NaN      NaN      NaN
9        Joe         P     79.0     75.0

## Drop NaN

In [27]:
df.dropna(inplace=True)
df.head(10)

  first_name last_name  score_1  score_2
0       Joan         T     91.0     91.0
1       Mary         K     83.0     85.0
2      Vijay         N     95.0     90.0
3        Rob         R     72.0     81.0
4     Martha         L     91.0     95.0
5       Josh         F     85.0     92.0
6      Vicky         R     89.0     88.0
7      Mario         L     82.0     94.0
9        Joe         P     79.0     75.0

## Assign data types

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  9 non-null      object
 1   last_name   9 non-null      object
 2   score_1     9 non-null      float64
 3   score_2     9 non-null      float64
dtypes: float64(2), object(2)
memory usage: 360.0+ bytes

In [29]:
# Based on example from https://www.geeksforgeeks.org/change-data-type-for-one-or-more-columns-in-pandas-dataframe
# Similar reference in https://stackoverflow.com/questions/49684951/pandas-read-csv-dtype-read-all-columns-but-few-as-string
dtypes_dict = {'first_name' : str,
               'last_name' : str,
               'score_1' : int,
               'score_2' : int}
df = df.astype(dtypes_dict)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  9 non-null      object
 1   last_name   9 non-null      object
 2   score_1     9 non-null      int32
 3   score_2     9 non-null      int32
dtypes: int32(2), object(2)
memory usage: 288.0+ bytes

## Add column / List comprehension

In [ ]:
df['s1_a'] = ['a' if col >= 90 else ' ' for col in df['score_1']]

In [ ]:
df.head(10)

In [ ]:
df['s2_a'] = ['a' if col >= 90 else ' ' for col in df['score_2']]

In [ ]:
df.head(10)

In [ ]:
df['improved'] = ['yes' if col2 > col1 else 'no' for col1, col2 in zip(df['score_1'], df['score_2'])]

In [ ]:
df.head(10)

##  Filter addl examples

In [ ]:
# The filter itself
df["score_1"] == df.score_1.max()

In [ ]:
# The filter applied, and to certain columns only
df[['first_name', 'last_name','score_1']][df["score_1"] == df.score_1.max()]

In [ ]:
# Another filter, applied, for practice
df[['first_name', 'last_name','score_1', 'score_2']][(df["score_1"] > 90) & (df['score_2'] > 90) ]